UCB_CS61_lec35.org
# -*- org-export-babel-evaluate: nil -*-
#+PROPERTY: header-args :eval never-export
#+PROPERTY: header-args:python :session 第三十五课 排序(4)
#+PROPERTY: header-args:ipython :session 第三十五课 排序(4)
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="/home/yiddi/git_repos/YIDDI_org_export_theme/theme/org-nav-theme_cache.css" >
#+HTML_HEAD: <script src="https://hypothes.is/embed.js" async></script>
#+HTML_HEAD: <script type="application/json" class="js-hypothesis-config">
#+HTML_HEAD: <script src="https://cdn.mathjax.org/mathjax/latest/MathJax.js?config=TeX-AMS-MML_HTMLorMML"></script>
#+OPTIONS: html-link-use-abs-url:nil html-postamble:nil html-preamble:t
#+OPTIONS: H:3 num:t ^:nil _:nil tags:not-in-toc
#+TITLE: 第三十五课 排序(四)
#+AUTHOR: yiddishkop
#+EMAIL: [[mailto:yiddishkop@163.com][yiddi's email]]
#+TAGS: {PKGIMPT(i) DATAVIEW(v) DATAPREP(p) GRAPHBUILD(b) GRAPHCOMPT(c)} LINAGAPI(a) PROBAPI(b) MATHFORM(f) MLALGO(m)


* Counting Sort
Counting Sort 更适合 Array 相比 LinkedList
** Item without value
If the items we sort are naked keys, with _no associated values_, bucket sort
can be simplified to become _counting_sort_.

这句是否意味着 CountingSort 也遵循Bucket Sort 对待排数列的要求：Q 个 Bucket，排
序 1～Q 数字

In counting sort, we use no queues at all; we need merely _keep a count of how
many copies of each key_ we have encountered.

#+BEGIN_EXAMPLE
Suppose we sort 6 7 3 0 3 1 5 0 3 7:

               0       1       2       3       4       5       6       7
           -----------------------------------------------------------------
    counts |   2   |   1   |   0   |   3   |   0   |   1   |   1   |   2   |
           -----------------------------------------------------------------

When we are finished counting, it is straightforward to reconstruct the sorted
keys from the counts:  0 0 1 3 3 3 5 6 7 7.
#+END_EXAMPLE



** Item include value
*** Counting Sort with Complete Items
Now let's go back to the case where we have complete items (key plus associated
value).  We can use a more elaborate version of counting sort.  The trick is to
use the counts to find the right index to move each item to.

Let x be an input array of objects with keys (and perhaps other information).

#+BEGIN_EXAMPLE
        0      1      2      3      4      5      6      7      8      9
    -----------------------------------------------------------------------
  x |   .  |   .  |   .  |   .  |   .  |   .  |   .  |   .  |   .  |   .  |
    ----|------|------|------|------|------|------|------|------|------|---
        v      v      v      v      v      v      v      v      v      v
      -----  -----  -----  -----  -----  -----  -----  -----  -----  -----
      | 6 |  | 7 |  | 3 |  | 0 |  | 3 |  | 1 |  | 5 |  | 0 |  | 3 |  | 7 |
      -----  -----  -----  -----  -----  -----  -----  -----  -----  -----
#+END_EXAMPLE

Begin by counting the keys in x.

#+NAME: x2counts
#+BEGIN_SRC java
  for (i = 0; i < x.length; i++) {
    counts[x[i].key]++;       // 一个数组的内容恰好是另一个数组的下标
  }
#+END_SRC

** Scan of counts array
   #+BEGIN_EXAMPLE
对于只有 key 的情况： 直接从 数列 ---------> counts array
                            num:index

                                                                        ________scan 累计获取位置
                                                                        V       |
对于(key,value):        数列 ---------> input array,x ----------> counts array -----------> output array,y
                            按顺序挂到                 提供 index              (i,c[i])=(key,value)
   #+END_EXAMPLE


Next, do a _scan_ of the "counts" array so that counts[i] contains the number
of keys _less_than_ i.

#+BEGIN_EXAMPLE
               0       1       2       3       4       5       6       7
           -----------------------------------------------------------------
    counts |   2   |   1   |   0   |   3   |   0   |   1   |   1   |   2   |
           -----------------------------------------------------------------

                                      |
                                      | scan
                                      V

               0       1       2       3       4       5       6       7
           -----------------------------------------------------------------
    counts |   0   |   2   |   3   |   3   |   6   |   6   |   7   |   8   |
           -----------------------------------------------------------------
#+END_EXAMPLE


#+NAME: counts2scan
#+BEGIN_SRC java
  total = 0;
  for (j = 0; j < counts.length; j++) {
    c = counts[j];
    counts[j] = total;
    total = total + c;
  }
#+END_SRC

Let y be the output array, where we will put the sorted objects. counts[i] tells
us the first index of y where we should put items with key i. Walk through the
array x and copy each item to its final position in y. When you copy an item
with key k, you must increment counts[k] to make sure that the next item with
key k goes into the next slot.
