UCB_CS61_lec35.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-08-09 四 19:46 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>第三十五课 排序(四)</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="yiddishkop" />
<link rel="stylesheet" type="text/css" href="/home/yiddi/git_repos/YIDDI_org_export_theme/theme/org-nav-theme_cache.css" >
</head>
<body>
<div id="content">
<h1 class="title">第三十五课 排序(四)</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org88d9779">1. Counting Sort</a>
<ul>
<li><a href="#orgc074d60">1.1. Item without value</a></li>
<li><a href="#orgf598ade">1.2. Item include value</a>
<ul>
<li><a href="#org8837aaa">1.2.1. Counting Sort with Complete Items</a></li>
</ul>
</li>
<li><a href="#org2085b00">1.3. Scan of counts array</a></li>
<li><a href="#org8ca71c6">1.4. Get output array from scanned counts</a></li>
<li><a href="#org4a742f7">1.5. 整体来看</a></li>
<li><a href="#org33a94e2">1.6. BucketSort and CountingSort</a></li>
<li><a href="#org4c239e8">1.7. Running Time of CountingSort</a></li>
</ul>
</li>
<li><a href="#orgaffafaf">2. Radix Sort</a>
<ul>
<li><a href="#org0b48a37">2.1. Sorting one <b>DIGIT</b> at a time</a></li>
<li><a href="#orgf6ca4ba">2.2. Sorting two <b>DIGITS</b> at a time</a></li>
<li><a href="#org565421c">2.3. Running time of RadixSort</a>
<ul>
<li><a href="#org3793a40">2.3.1. How many passes must we perform?</a></li>
<li><a href="#org34cbaec">2.3.2. How should we choose the number of queues q?</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org7d59d24">3. Postscript:  Radix Sort Rocks (not examinable)</a></li>
</ul>
</div>
</div>


<div id="org88d9779" class="outline-2">
<h2 id="org88d9779"><span class="section-number-2">1</span> Counting Sort</h2>
<div class="outline-text-2" id="text-1">
<p>
Counting Sort 更适合 Array 相比 LinkedList
</p>
</div>
<div id="orgc074d60" class="outline-3">
<h3 id="orgc074d60"><span class="section-number-3">1.1</span> Item without value</h3>
<div class="outline-text-3" id="text-1-1">
<p>
If the items we sort are naked keys, with <span class="underline">no associated values</span>, bucket sort
can be simplified to become <span class="underline">counting_sort</span>.
</p>

<p>
这句是否意味着 CountingSort 也遵循Bucket Sort 对待排数列的要求：Q 个 Bucket，排序 1～Q 数字
</p>

<p>
In counting sort, we use no queues at all; we need merely <span class="underline">keep a count of how
many copies of each key</span> we have encountered.
</p>

<pre class="example">
Suppose we sort 6 7 3 0 3 1 5 0 3 7:

               0       1       2       3       4       5       6       7
           -----------------------------------------------------------------
    counts |   2   |   1   |   0   |   3   |   0   |   1   |   1   |   2   |
           -----------------------------------------------------------------

When we are finished counting, it is straightforward to reconstruct the sorted
keys from the counts:  0 0 1 3 3 3 5 6 7 7.
</pre>
</div>
</div>



<div id="orgf598ade" class="outline-3">
<h3 id="orgf598ade"><span class="section-number-3">1.2</span> Item include value</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="org8837aaa" class="outline-4">
<h4 id="org8837aaa"><span class="section-number-4">1.2.1</span> Counting Sort with Complete Items</h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
Now let's go back to the case where we have complete items (key plus associated
value).  We can use a more elaborate version of counting sort.  The trick is to
use the counts to find the right index to move each item to.
</p>

<p>
Let x be an input array of objects with keys (and perhaps other information).
</p>

<pre class="example">
      0      1      2      3      4      5      6      7      8      9
  -----------------------------------------------------------------------
x |   .  |   .  |   .  |   .  |   .  |   .  |   .  |   .  |   .  |   .  |
  ----|------|------|------|------|------|------|------|------|------|---
      v      v      v      v      v      v      v      v      v      v
    -----  -----  -----  -----  -----  -----  -----  -----  -----  -----
    | 6 |  | 7 |  | 3 |  | 0 |  | 3 |  | 1 |  | 5 |  | 0 |  | 3 |  | 7 |
    -----  -----  -----  -----  -----  -----  -----  -----  -----  -----
</pre>

<p>
Begin by counting the keys in x.
</p>

<div class="org-src-container">
<pre class="src src-java" id="orgaa3adaa"><span style="color: #4f97d7; font-weight: bold;">for</span> (i = <span style="color: #a45bad;">0</span>; i &lt; x.<span style="color: #ce537a; font-weight: bold;">length</span>; i++) {
  counts[x[i].key]++;       <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">&#19968;&#20010;&#25968;&#32452;&#30340;&#20869;&#23481;&#24688;&#22909;&#26159;&#21478;&#19968;&#20010;&#25968;&#32452;&#30340;&#19979;&#26631;</span>
}
</pre>
</div>
</div>
</div>
</div>

<div id="org2085b00" class="outline-3">
<h3 id="org2085b00"><span class="section-number-3">1.3</span> Scan of counts array</h3>
<div class="outline-text-3" id="text-1-3">
<pre class="example">
对于只有 key 的情况： 直接从 数列 ---------&gt; counts array
                            num:index

                                                                        ________scan 累计获取位置
                                                                        V       |
对于(key,value):        数列 ---------&gt; input array,x ----------&gt; counts array -----------&gt; output array,y
                            按顺序挂到                 提供 index              (i,c[i])=(key,value)
</pre>


<p>
Next, do a <span class="underline">scan</span> of the "counts" array so that counts[i] contains the number
of keys <span class="underline">less_than</span> i.
</p>

<pre class="example">
           0       1       2       3       4       5       6       7
       -----------------------------------------------------------------
counts |   2   |   1   |   0   |   3   |   0   |   1   |   1   |   2   |
       -----------------------------------------------------------------

                                  |
                                  | scan
                                  V

           0       1       2       3       4       5       6       7
       -----------------------------------------------------------------
counts |   0   |   2   |   3   |   3   |   6   |   6   |   7   |   8   |
       -----------------------------------------------------------------
</pre>


<div class="org-src-container">
<pre class="src src-java" id="org70a5819">total = <span style="color: #a45bad;">0</span>;
<span style="color: #4f97d7; font-weight: bold;">for</span> (j = <span style="color: #a45bad;">0</span>; j &lt; counts.<span style="color: #ce537a; font-weight: bold;">length</span>; j++) {
  c = counts[j];
  counts[j] = total;
  total = total + c;
}
</pre>
</div>

<p>
Let y be the output array, where we will put the sorted objects. counts[i] tells
us the first index of y where we should put items with key i. Walk through the
array x and copy each item to its final position in y. When you copy an item
with key k, you must increment counts[k] to make sure that the next item with
key k goes into the next slot.
</p>
</div>
</div>
