UCB_CS61_lec35.org
** Get output array from scanned counts
#+NAME: scan2y
#+BEGIN_SRC java
  for (i = 0; i < x.length; i++) {
    y[counts[x[i].key]] = x[i];    // x[i]存放的是 ref2item
    counts[x[i].key]++;            // 通过 x[i]检索 counts，
  }
#+END_SRC

#+BEGIN_EXAMPLE
      ---------------------           ---------------------------------
    y |.|.|.|.|.|.|.|.|.|.|    counts | 0 | 2 | 3 | 3 | 6 | 6 | 8 | 8 |
      ---------------|-----           ---------------------------------
                     v
                     6

      ---------------------           ---------------------------------
    y |.|.|.|.|.|.|.|.|.|.|    counts | 0 | 2 | 3 | 3 | 6 | 6 | 8 | 9 |
      ---------------|-|---           ---------------------------------
                     v v
                     6 7

      ---------------------           ---------------------------------
    y |.|.|.|.|.|.|.|.|.|.|    counts | 0 | 2 | 3 | 4 | 6 | 6 | 8 | 9 |
      -------|-------|-|---           ---------------------------------
             v       v v
             3       6 7

      ---------------------           ---------------------------------
    y |.|.|.|.|.|.|.|.|.|.|    counts | 1 | 2 | 3 | 4 | 6 | 6 | 8 | 9 |
      -|-----|-------|-|---           ---------------------------------
       v     v       v v
       0     3       6 7

      ---------------------           ---------------------------------
    y |.|.|.|.|.|.|.|.|.|.|    counts | 1 | 2 | 3 | 5 | 6 | 6 | 8 | 9 |
      -|-----|-|-----|-|---           ---------------------------------
       v     v v     v v
       0     3 3     6 7

      ---------------------           ---------------------------------
    y |.|.|.|.|.|.|.|.|.|.|    counts | 1 | 3 | 3 | 5 | 6 | 6 | 8 | 9 |
      -|---|-|-|-----|-|---           ---------------------------------
       v   v v v     v v
       0   1 3 3     6 7

...

      ---------------------           ----------------------------------
    y |.|.|.|.|.|.|.|.|.|.|    counts | 2 | 3 | 3 | 6 | 6 | 7 | 8 | 10 |
      -|-|-|-|-|-|-|-|-|-|-           ----------------------------------
       v v v v v v v v v v
       0 0 1 3 3 3 5 6 7 7

#+END_EXAMPLE

** 整体来看
   #+BEGIN_EXAMPLE
input ->按顺序挂在数组上-> array:x
                              ->x[i].key 作为 index;key 出现次数作为内容-> array:counts
                                                                                ->从后往前 sum-> scan:counts ->

当 scan：counts 形成之后，x[i]问，我应该在哪，那我就去 counts 查一下就找到自己的位置了。
   #+END_EXAMPLE

#+BEGIN_SRC java
i = 0 -> len(x):
  j = x[i].key; // x 中存的是 counts 的 index
  h = counts[j];// counts 中存的是 y 的 index
  y[h] = x[i];  // y 中存的是 排序后的 x
  counts[j]++;  // counts 被访问一次就自动加 1,因为 counts 存的是 y 的 index，所以下一次访问应该自动往后排
#+END_SRC
** BucketSort and CountingSort

- q: maximum key of items; 对应 bucket(or queue)
- n: number of items

- Bucket Sort or Counting Sort 对于键值 key 的最大值 or 范围有很苛刻的要求。
- Bucket Sort or Counting Sort 更适合处理 items 的 key 的分布范围和 items 数量保持一致的数列。
#+BEGIN_EXAMPLE
比如，min(item.key) = 1; max(item.key)=100; ====> q = 100
     number(item) = 100;                   ====> n = 100
     q = O(n) BucketSort or [[*Counting Sort][Counting Sort]]
如果，min(item.key) = 1000; max(item.key) = 1100; ====> q = 1100
     number(item) = 100;                         ====> n = 100
     q >> n +BucketSort or [[*Counting Sort][Counting Sort]]+ [[*Radix Sort][Radix Sort]]
#+END_EXAMPLE


| BucketSort 的核心是   | item with key I goes into queue(key) I;    如果 key 值过大，queue 要有多少个？            |
| CountingSort 的核心是 | 借助以 key 值为 index 的数组 counts 进行排序; 如果 key 值过大，那 counts 数组要申请很大。 |
| RadixSort 的核心是    | 进行 ceiling(b/ log_2 q) 轮 BucketSort or CountingSort                                    |

** Running Time of CountingSort
Bucket sort and counting sort both take O(q + n) time.
- q is the number of different possible keys;
- n is the number of items were soring
#+BEGIN_EXAMPLE
- If q is in O(n),
  then they take O(n) LINEAR time.
- If you're sorting an array,
  counting sort is slightly faster and takes less memory
  than [Bucket Sort], though it's a little harder to understand.
- If you're sorting a linked list,
  [Bucket Sort] is more natural, because you've already got listnodes
  ready to put into the buckets.
#+END_EXAMPLE

However, if q is not in O(n)--there are many more _possible_values_ for keys
than keys--we need a more aggressive method to get linear-time performance. What
do we do if q >> n?
* Radix Sort
Suppose we want to sort 1,000 items in the range from 0 to <<99,999,999>>. If we
use bucket sort, we'll spend so much time initializing and concatenating empty
queues we'll wish we'd used selection sort instead.
