UCB_CS61_lec35.html
<div id="org8ca71c6" class="outline-3">
<h3 id="org8ca71c6"><span class="section-number-3">1.4</span> Get output array from scanned counts</h3>
<div class="outline-text-3" id="text-1-4">
<div class="org-src-container">
<pre class="src src-java" id="org0d412a3"><span style="color: #4f97d7; font-weight: bold;">for</span> (i = <span style="color: #a45bad;">0</span>; i &lt; x.<span style="color: #ce537a; font-weight: bold;">length</span>; i++) {
  y[counts[x[i].key]] = x[i];    <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">x[i]&#23384;&#25918;&#30340;&#26159; ref2item</span>
  counts[x[i].key]++;            <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">&#36890;&#36807; x[i]&#26816;&#32034; counts&#65292;</span>
}
</pre>
</div>

<pre class="example">
      ---------------------           ---------------------------------
    y |.|.|.|.|.|.|.|.|.|.|    counts | 0 | 2 | 3 | 3 | 6 | 6 | 8 | 8 |
      ---------------|-----           ---------------------------------
                     v
                     6

      ---------------------           ---------------------------------
    y |.|.|.|.|.|.|.|.|.|.|    counts | 0 | 2 | 3 | 3 | 6 | 6 | 8 | 9 |
      ---------------|-|---           ---------------------------------
                     v v
                     6 7

      ---------------------           ---------------------------------
    y |.|.|.|.|.|.|.|.|.|.|    counts | 0 | 2 | 3 | 4 | 6 | 6 | 8 | 9 |
      -------|-------|-|---           ---------------------------------
             v       v v
             3       6 7

      ---------------------           ---------------------------------
    y |.|.|.|.|.|.|.|.|.|.|    counts | 1 | 2 | 3 | 4 | 6 | 6 | 8 | 9 |
      -|-----|-------|-|---           ---------------------------------
       v     v       v v
       0     3       6 7

      ---------------------           ---------------------------------
    y |.|.|.|.|.|.|.|.|.|.|    counts | 1 | 2 | 3 | 5 | 6 | 6 | 8 | 9 |
      -|-----|-|-----|-|---           ---------------------------------
       v     v v     v v
       0     3 3     6 7

      ---------------------           ---------------------------------
    y |.|.|.|.|.|.|.|.|.|.|    counts | 1 | 3 | 3 | 5 | 6 | 6 | 8 | 9 |
      -|---|-|-|-----|-|---           ---------------------------------
       v   v v v     v v
       0   1 3 3     6 7

...

      ---------------------           ----------------------------------
    y |.|.|.|.|.|.|.|.|.|.|    counts | 2 | 3 | 3 | 6 | 6 | 7 | 8 | 10 |
      -|-|-|-|-|-|-|-|-|-|-           ----------------------------------
       v v v v v v v v v v
       0 0 1 3 3 3 5 6 7 7

</pre>
</div>
</div>

<div id="org4a742f7" class="outline-3">
<h3 id="org4a742f7"><span class="section-number-3">1.5</span> 整体来看</h3>
<div class="outline-text-3" id="text-1-5">
<pre class="example">
input -&gt;按顺序挂在数组上-&gt; array:x
                              -&gt;x[i].key 作为 index;key 出现次数作为内容-&gt; array:counts
                                                                                -&gt;从后往前 sum-&gt; scan:counts -&gt;

当 scan：counts 形成之后，x[i]问，我应该在哪，那我就去 counts 查一下就找到自己的位置了。
</pre>

<div class="org-src-container">
<pre class="src src-java">i = <span style="color: #a45bad;">0</span> -&gt; len(x):
  j = x[i].key; <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">x &#20013;&#23384;&#30340;&#26159; counts &#30340; index</span>
  h = counts[j];<span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">counts &#20013;&#23384;&#30340;&#26159; y &#30340; index</span>
  y[h] = x[i];  <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">y &#20013;&#23384;&#30340;&#26159; &#25490;&#24207;&#21518;&#30340; x</span>
  counts[j]++;  <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">counts &#34987;&#35775;&#38382;&#19968;&#27425;&#23601;&#33258;&#21160;&#21152; 1,&#22240;&#20026; counts &#23384;&#30340;&#26159; y &#30340; index&#65292;&#25152;&#20197;&#19979;&#19968;&#27425;&#35775;&#38382;&#24212;&#35813;&#33258;&#21160;&#24448;&#21518;&#25490;</span>
</pre>
</div>
</div>
</div>
<div id="org33a94e2" class="outline-3">
<h3 id="org33a94e2"><span class="section-number-3">1.6</span> BucketSort and CountingSort</h3>
<div class="outline-text-3" id="text-1-6">
<ul class="org-ul">
<li>q: maximum key of items; 对应 bucket(or queue)</li>
<li>n: number of items</li>

<li>Bucket Sort or Counting Sort 对于键值 key 的最大值 or 范围有很苛刻的要求。</li>
<li>Bucket Sort or Counting Sort 更适合处理 items 的 key 的分布范围和 items 数量保持一致的数列。</li>
</ul>
<pre class="example">
比如，min(item.key) = 1; max(item.key)=100; ====&gt; q = 100
     number(item) = 100;                   ====&gt; n = 100
     q = O(n) BucketSort or [[*Counting Sort][Counting Sort]]
如果，min(item.key) = 1000; max(item.key) = 1100; ====&gt; q = 1100
     number(item) = 100;                         ====&gt; n = 100
     q &gt;&gt; n +BucketSort or [[*Counting Sort][Counting Sort]]+ [[*Radix Sort][Radix Sort]]
</pre>


<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">BucketSort 的核心是</td>
<td class="org-left">item with key I goes into queue(key) I;    如果 key 值过大，queue 要有多少个？</td>
</tr>

<tr>
<td class="org-left">CountingSort 的核心是</td>
<td class="org-left">借助以 key 值为 index 的数组 counts 进行排序; 如果 key 值过大，那 counts 数组要申请很大。</td>
</tr>

<tr>
<td class="org-left">RadixSort 的核心是</td>
<td class="org-left">进行 ceiling(b/ log_2 q) 轮 BucketSort or CountingSort</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="org4c239e8" class="outline-3">
<h3 id="org4c239e8"><span class="section-number-3">1.7</span> Running Time of CountingSort</h3>
<div class="outline-text-3" id="text-1-7">
<p>
Bucket sort and counting sort both take O(q + n) time.
</p>
<ul class="org-ul">
<li>q is the number of different possible keys;</li>
<li>n is the number of items were soring</li>
</ul>
<pre class="example">
- If q is in O(n),
  then they take O(n) LINEAR time.
- If you're sorting an array,
  counting sort is slightly faster and takes less memory
  than [Bucket Sort], though it's a little harder to understand.
- If you're sorting a linked list,
  [Bucket Sort] is more natural, because you've already got listnodes
  ready to put into the buckets.
</pre>

<p>
However, if q is not in O(n)&#x2013;there are many more <span class="underline">possible_values</span> for keys
than keys&#x2013;we need a more aggressive method to get linear-time performance. What
do we do if q &gt;&gt; n?
</p>
</div>
</div>
</div>
<div id="orgaffafaf" class="outline-2">
<h2 id="orgaffafaf"><span class="section-number-2">2</span> Radix Sort</h2>
<div class="outline-text-2" id="text-2">
<p>
Suppose we want to sort 1,000 items in the range from 0 to <a id="org5d0adbf"></a>. If we
use bucket sort, we'll spend so much time initializing and concatenating empty
queues we'll wish we'd used selection sort instead.
</p>
</div>
