UCB_CS61_lec35.html
<div id="org0b48a37" class="outline-3">
<h3 id="org0b48a37"><span class="section-number-3">2.1</span> Sorting one <b>DIGIT</b> at a time</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Instead of providing 100 million buckets, let's provide q = 10 buckets and sort
on the first digit only.  (A number less than 10 million is said to have a
first digit of zero.)  We use bucket sort or counting sort, treating each item
as if its key is the first digit of its true key.
</p>

<pre class="example">
        0      1      2      3      4      5      6      7      8      9
    -----------------------------------------------------------------------
    |   .  |   .  |   *  |   .  |   *  |   .  |   .  |   .  |   *  |   .  |
    ----|------|-------------|-------------|------|------|-------------|---
        v      v             v             v      v      v             v
     ------ ------        ------        ------ ------ ------        ------
     | 342| |1390|        |3950|        |5384| |6395| |7394|        |9362|
     |9583| |5849|        |8883|        |2356| |1200| |2039|        |9193|
     ---|-- ------        ---|--        ------ ------ ---|--        ---|--
        v                    v                           v             v
     ------               ------                      ------        ------
     |  59|               |3693|                      |7104|        |9993|
     |2178|               |7834|                      |2114|        |3949|
     ------               ------                      ------        ------
不满 8 位数的，首位按 0 算

</pre>

<p>
Once we've dealt all 1,000 items into ten queues, we could sort each queue
recursively on the second digit; then sort the resulting queues on the third
digit, and so on.  Unfortunately, this tends to break the set of input items
into smaller and smaller subsets, each of which will be sorted relatively
inefficiently.
</p>

<p>
Instead, we use a clever but counterintuitive idea:  we'll keep all the numbers
together in one big pile throughout the sort; but we'll sort on the <span class="underline">last</span>
digit first, then the next-to-last, and so on up to the most significant digit.
</p>

<p>
The reason this idea works is because bucket sort and counting sort are stable.
Hence, once we've sorted on the last digit, the numbers 55,555,552 and
55,555,558 will remain ever after in sorted order, because their other digits
will be sorted stably. Consider an example with three-digit numbers:
</p>

<p>
stable 的意思是如果 key 相同，两个数输入时的顺序和排序完输出时的顺序保持一致;
因为这里是一轮一轮进行的，所以上一轮的输出就是下一轮的输入，某一轮对末尾 digit 进行排序，把 55,555,552 排在 55,555,558 之前，之后由于两个数字全部一样，那么两个数字顺序保持不变。
</p>

<p>
这一点非常重要，由于下一轮不会打破上一轮的排序，所以才允许层层进行排序。
</p>

<pre class="example">
Sort on 1s:    771 721 822 955 405   5 925 825 777  28 829
Sort on 10s:   405   5 721 822 925 825  28 829 955 771 777
Sort on 100s:    5  28 405 721 771 777 822 825 829 925 955
</pre>

<p>
After we sort on the middle digit, observe that the numbers are sorted by their
last two digits.  After we sort on the most significant digit, the numbers are
completely sorted.
</p>
</div>
</div>

<div id="orgf6ca4ba" class="outline-3">
<h3 id="orgf6ca4ba"><span class="section-number-3">2.2</span> Sorting two <b>DIGITS</b> at a time</h3>
<div class="outline-text-3" id="text-2-2">
<pre class="example">
当我们每次只排一位，一轮轮的排序，每一轮都是 0～9,共 10 个 bucket(queue), radix=10;
当。。。。。。二位，。。。。。。，每一轮都是 0～99,共 100 个 bucket(queue), radix=100;
所以，q, key，bucket，queue, radix 这四个概念是相关的。甚至可以说是一样的。
</pre>

<p>
Returning to our <a href="#org5d0adbf">eight-digit</a> example, we can do better than sorting on one
decimal digit at a time. With 1,000 keys, sorting would likely be faster if we
sort on <span class="underline">two digits</span> at a time (using a base, or <span class="underline">radix</span>, of q = 100) or even
three (using a radix of q = 1,000). Furthermore, there's no need to use decimal
digits at all; on computers, it's more natural to choose a <span class="underline">power-of-two</span>
<span class="underline">radix</span> like q = 256. Base-256 digits are easier to extract from a key, because
we can quickly pull out the eight bits that we need by using <span class="underline">bit operators</span>
(which you'll study in detail in CS 61C).
</p>

<p>
Note that q is both the number of buckets we're using to sort, and the radix of
the digit we use as a sort key during one pass of bucket or counting sort.
"Radix" is a synonym for the base of a number, hence the name "radix sort."
</p>
</div>
</div>
<div id="org565421c" class="outline-3">
<h3 id="org565421c"><span class="section-number-3">2.3</span> Running time of RadixSort</h3>
<div class="outline-text-3" id="text-2-3">
</div>
<div id="org3793a40" class="outline-4">
<h4 id="org3793a40"><span class="section-number-4">2.3.1</span> How many passes must we perform?</h4>
<div class="outline-text-4" id="text-2-3-1">
<pre class="example">
Each pass inspects _(log_2 q)_ bits of each key.
10 进制：这个很好理解，如果是每次比较 1 位，那么需要 0～9  共 10 个 bucket，(log_10 10)=1
 2 进制：。。。。。。，。。。。。。。1 位，。。。。0～1  共  2 个 bucket，(log_2   2)=1
       。。。。。。，。。。。。。。8 位，。。。。0～255 共 256 个 bucket，(log_2 256)=8

If all the keys can be represented in b bits,
以 64bit 系统为例，每一轮(each pass)搞定 8 bits，那么共需要 8 轮来排定一个 64bit 数字。
而 64bit 数字可以表示正整数的范围是：0~9,223,372,036,854,775,807
这里，b=64, q=256, ceiling(b / log_2 q) = ceiling(64 / log_2 256) = 8

the number of passes is _ceiling(b / log2 q)_.
So the running time of radix sort is in
|                         b
|  O( (n + q) ceiling( ------ ) ).
|                      log  q
|                         2

因为 RadixSort 相当于进行多轮 BucketSort or CountingSort，共 ceiling(b / log_2 q),
而每一轮都都耗时(Running time of [[*Running time of BucketSort][B]] and [[*Running Time of CountingSort][C]]) O(q+n):
- q: 需要初始化 q 个 queue;
- n: 需要把 n 个 items 放在相应的 queue 上;
所以结果是：O(n+q)*ceiling(b/log_2 q)
</pre>
</div>
</div>


<div id="org34cbaec" class="outline-4">
<h4 id="org34cbaec"><span class="section-number-4">2.3.2</span> How should we choose the number of queues q?</h4>
<div class="outline-text-4" id="text-2-3-2">
<pre class="example">
|                         b
|  O( (n + _q_) ceiling( ------ ) ).
|                      log  _q_
|                         2
q occur two times in this formula:
1. if q is too large:
   - will cost more time one pass: '(n+q)'
   - will have less number of passes: '(b/log2 q)'
2. vice and versa

</pre>


<p>
Advices:
Let's choose q to be in O(n), so each pass of bucket sort or counting sort takes
O(n) time. However, we want q to be large enough to keep the number of passes
small.
</p>

<pre class="example">
1. _q = approximately n_, RadixSort takes Linear-Time.
   With this choice, the
   number of passes is in O(1 + b / log2 n), and radix sort takes

   |          b
   |  O(n + ----- n) time.
   |        log n

   For many kinds of keys we might sort (like ints), b is technically a constant,
   and radix sort takes linear time.  Even if the key length b tends to grow
   logarithmically with n (a reasonable model in many applications), radix sort
   runs in time linear in the total number of bits in all the keys together.

2. _q = sqrt(n)_, far smaller memory
   If we want to keep _memory use low_, however, we can make q equal to sqrt(n),
   rounded to the nearest power of two.

   |    O((n+sqrt(n)) *     (b/log2 sqrt(n)))
   |  = O((n+sqrt(n)) * 2 * (b/log2 n))

   这样需要进行的轮数仅仅是翻倍，但使用的 queue 却指数级减少，占用 memory 显著减少
   With this choice, the number of buckets is far smaller, but we only
   double the number of passes.make q equal to n rounded down to the next
   power of two.

</pre>
</div>
</div>
</div>
</div>
