UCB_CS61_lec35.org
* Postscript:  Radix Sort Rocks (not examinable)
Linear-time sorts tend to get less attention than comparison-based sorts in
most computer science classes and textbooks.  Perhaps this is because the
theory behind linear-time sorts isn't as interesting as for other algorithms.
Nevertheless, the library sort routines for machines like Crays use radix sort,
because it kicks major ass in the speed department.

Radix sort can be used not only with integers, but with almost any data that
can be compared bitwise, like strings.  The IEEE standard for floating-point
numbers is designed to work with radix sort combined with a simple prepass and
postpass (to flip the bits, except the sign bit, of each negative number).

Strings of different lengths can be sorted in time proportional to the total
length of the strings.

1. A first stage sorts the strings by their lengths.
2. A second stage sorts the strings character by character (or several
   characters at a time), starting with the last character of the longest string
   and working backward to the first character of every string.

We don't sort every string during every pass of the second stage; instead, a
string is included in a pass only if it has a character in the appropriate
place.

For instance, suppose we're sorting the strings CC, BA, CCAAA, BAACA, and
BAABA.  After we sort them by length, the next three passes sort only the last
three strings by their last three characters, yielding CCAAA BAABA BAACA.  The
fifth pass is on the second character of each string, so we prepend the
two-character strings to our list, yielding CC BA CCAAA BAABA BAACA.  After
sorting on the second and first characters, we end with

#+BEGIN_EXAMPLE
  BA BAABA BAACA CC CCAAA.
#+END_EXAMPLE

Observe that BA precedes BAABA and CC precedes CCAAA because of the stability of
the sort. That's why we put the two-character strings before the five- character
strings when we began the fifth pass.
